import solutionMethods as sm

# x и y из 1 задания
xy1 = [[0.15, 4.4817], [0.16, 4.953], [0.17, 5.4739], [0.18, 6.0496],[0.19, 6.6859], [0.20, 7.3891], [0.21, 8.1662], [0.22, 9.025], [0.23, 9.9742], [0.24, 11.0232], [0.25, 12.1825], [0.26, 13.4637], [0.27, 13.5123]]
xi = [0.166, 0.266, 0.277, 0.144, 0.22] # Точки, в которых нужно найти значения функции в первом задании

xy2 = [[0.43, 1.63597], [0.48, 1.73234], [0.55, 1.87686], [0.62, 2.03345], [0.70, 2.22846], [0.75, 2.35973]] # x и y  из 2 задания
xj = [0.512, 0.441] # Точки, в которых нужно найти значения функции во втором задании
 

sm.newtonPolynomial(xy1, xi)
sm.lagrangEquitable(xy1, xi)
sm.lagrangUnequitable(xy2, xj)