import solutionMethods as sm

# x и y из 1 задания
xy1 = [[0.01, 0.991824], [0.06, 0.951935], [0.11, 0.91365], [0.16, 0.876905],[0.21, 0.841638], [0.26, 0.807789], [0.31, 0.775301], [0.36, 0.74412], [0.41, 0.714193], [0.46, 0.68547], [0.51, 0.657902], [0.56, 0.631442], [0.61, 0.611242]]
xi = [0.11, 0.13, 0.62, 0.005, 0.44] # Точки, в которых нужно найти значения функции в первом задании

xy2 = [[0.41, 2.57418], [0.46, 2.32513], [0.52, 2.09336], [0.60, 1.86208], [0.65, 1.74926], [0.72, 1.62098]] # x и y  из 2 задания
xj = [0.616, 0.444] # Точки, в которых нужно найти значения функции во втором задании
 

sm.newtonPolynomial(xy1, xi)
sm.lagrangEquitable(xy1, xi)
sm.lagrangUnequitable(xy2, xj)